docs: update README for GitHub
